#include <iostream>
#include <windows.h>
#include<time.h>
using namespace std;
int main()
{
    SetConsoleOutputCP(1251);
    SetConsoleCP(1251);

    /*завдання 1 вивести на екран усі числа від нуля до введеного користувачем числа.*/
    /*
    int a;
    cout << "введіть число : ";
    cin >> a;
    for (int i = 0; i <= a; i++)
    {
        cout << " "<<i;
    }

    */

    /*завдання 2. користувач вводить дві межі діапазону, вивести на екран усі числа з цього діапазону. передбачити,
щоб користувач міг вводити межі діапазону в довільному
порядку.
■ вивести всі парні числа з діапазону.
■ вивести всі непарні числа з діапазону.
■ вивести всі числа, кратні семи.
*/
//int min, max, tmp;
//cout << "введіть діапазон ";
//cin >> min;
//cin >> max;

//if (min>max)
//{
//    tmp = min;
//    min = max;
//    max = tmp;
//}

//cout << "всі числа : ";
//for (int i = min; i <= max; i++)
//{
//    cout << " " << i;
//}
//cout << "\n";
//cout << "всі парні числа : ";
//for (int i = min; i <= max; i++)
//{
//   if(i%2==0 ) cout << " " << i;
//}
//cout << "\n";
//cout << "всі neпарні числа : ";
//for (int i = min; i <= max; i++)
//{
//    if (i % 2 == 1) cout << " " << i;
//}
//cout << "\n";
//cout << "всі числа які діляться на 7 : ";
//for (int i = min; i <= max; i++)
//{
//    if (i % 7 == 0) cout << " " << i;
//}



///*завдання 3. користувач вводить дві межі діапазону. порахувати суму всіх чисел діапазону.*/
//cout << "\n";
//long summ = 0;


//cout << "сума : ";
//for (int i = min; i <= max; i++)
//{
//    summ += i;

//}
//cout << " " << summ;

/*завдання 4. користувач з клавіатури вводить числа. порахувати їхню суму і вивести на екран, щойно користувач
введе нуль.*/
/* int numm;
 long summ2 = 0;
 do
 {
     cout << "введіть числа : ( 0- стоп)";
     cin >> numm;
     summ2 += numm;
 } while (numm != 0);
     cout << "сумма = "<<summ2;*/

     /*Завдання для самостійної роботи 2
 Завдання 1. Написати гру «Вгадай число». Програма
 загадує число в діапазоні від 1 до 500. Користувач намагається його вгадати. Після кожної спроби програма
 видає підказки, чи його число є більшим або меншим за
 задумане. У кінці програма видає статистику: за скільки
 спроб угадано число, скільки часу це зайняло. Передбачити вихід за допомогою 0, у разі, якщо користувачеві
 набридло вгадувати число.
 */
    int compn = rand() % 500 + 1;
    int numm;
    int count = 0;
    int Starttime = time(NULL);
    int endtime;
    srand(time(NULL));
    cout << "Вгадай число :\n ";
    do
    {
        cout << "Введіть число :";
        cin >> numm;
        count++;
        if (numm < compn)
        {
            cout << "Моє число більше!";
        }
        else if (numm > compn)
        {
            cout << "Моє число менше!";
        }
        else
        {
            cout << "Вітаю! Ви вгадали число!";
            break;
        }
    } while (numm != 0);
    endtime = time(NULL);
    cout << "Ви спробували " << count << " " << "разів\n";
    cout << "Ви витратили : " << (endtime - Starttime) << "" << "секунд";
}